{
  name: "nurse survey",
  id: "nurse_survey",
  series: "Automatically Generated Task",
  author: "User",
  version: 1,
  text: "In healthcare systems, nurses play an essential role, not only because they are the largest segment of the workforce, but also because they perform a range of critical functions at all points along the continuum of care and services. While the issue of nursing staff availability is often the main focus of attention, their workplace experience can have an impact on both the nursing workforce and the quality of care provided by nurses.\r\nDespite the importance of nurses’ workplace experience and its many implications, it remains a complex and ambiguous concept open to diverse interpretations. The current literature, while abundant, provides only fragmented and heterogeneous views of this concept, either because its multiple dimensions are more often considered in isolation rather than together, or because the orientations taken often differ from one study to another. As a result, managers lack clear guidelines on the levers that can be mobilized to improve nurses’ workplace experience and thereby generate positive effects on patients and organizations in terms of quality of care and performance. Producing a comprehensive portrait of the workplace experience of nurses and implementing improvement strategies therefore requires a conceptualization that takes into account the multidimensional nature of the concept.",
  text_source: "National Library of Medicine",
  text_licence: "CC-BY",
  text_url: "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC6417134/",
  tasks: [
    {
      name: "nurse survey task 0",
      type: "R",
      interaction: "SHORT",
      primary: true,
      show_lesson_text: true,
      question: "What is often the main focus of attention for nurses?",
      answer: "staff availability",
    },
    {
      name: "nurse survey task 1",
      type: "R",
      interaction: "SHORT",
      primary: false,
      show_lesson_text: true,
      question: "What is a complex and ambiguous concept?",
      answer: "nurses ’ workplace experience",
    },
    {
      name: "nurse survey task 2",
      type: "R",
      interaction: "SHORT",
      primary: false,
      show_lesson_text: true,
      question: "What is the current literature of nurses' workplace experience?",
      answer: "heterogeneous views",
    },
  ],
}