{
  name: "Deep brain stimulation in Parkinson’s disease: state of the art and future perspectives",
  id: "deep_brain_stimulation_in_parkinson’s_disease:_state_of_the_art_and_future_perspectives",
  series: "Automatically Generated Task",
  author: "User",
  version: 1,
  text: "For more than 30 years, Deep Brain Stimulation (DBS) has been a therapeutic option for Parkinson’s disease (PD) treatment. However, this therapy is still underutilized mainly due to misinformation regarding risks and clinical outcomes. DBS can ameliorate several motor and non-motor symptoms, improving patients’ quality of life. Furthermore, most of the improvement after DBS is long-lasting and present even in advanced PD. Adequate patient selection, precise electric leads placement, and correct DBS programming are paramount for good surgical outcomes. Nonetheless, DBS still has many limitations: axial symptoms and signs, such as speech, balance and gait, do not improve to the same extent as appendicular symptoms and can even be worsened as a direct or indirect consequence of surgery and stimulation. In addition, there are still unanswered questions regarding patient’s selection, surgical planning and programming techniques, such as the role of surgical genomics, more precise imaging-based lead placement, new brain targets, advanced programming strategies and hardware features. The net effect of these innovations should not only be to refine the beneficial effect we currently observe on selected symptoms and signs but also to improve treatment resistant facets of PD, such as axial and non-motor features.",
  text_source: "SciELO",
  text_licence: "CC-BY",
  text_url: "https://scielo.figshare.com/articles/dataset/Deep_brain_stimulation_in_Parkinson_s_disease_state_of_the_art_and_future_perspectives/20484462",
  tasks: [
    {
      name: "Deep brain stimulation in Parkinson’s disease: state of the art and future perspectives task 0",
      type: "R",
      interaction: "SHORT",
      primary: true,
      show_lesson_text: true,
      question: "What is the term for Parkinson's disease?",
      answer: "pd",
    },
    {
      name: "Deep brain stimulation in Parkinson’s disease: state of the art and future perspectives task 1",
      type: "R",
      interaction: "SHORT",
      primary: false,
      show_lesson_text: true,
      question: "What does DBS improve?",
      answer: "patients ’ quality",
    },
    {
      name: "Deep brain stimulation in Parkinson’s disease: state of the art and future perspectives task 2",
      type: "R",
      interaction: "SHORT",
      primary: false,
      show_lesson_text: true,
      question: "What is the name of the disease that DBS is used for?",
      answer: "parkinson",
    },
  ],
}