// 3 lesson
{
  name: "Level A",  // the name that's also shown to the users
  id: "level-A",        // an internal id, will never be shown, but important to identify the lesson
  series: 'Adaptive Pretest',
  author: "Aura Kampf",    // used for documentation, will not be shown to the user
  version: 1,                 // if you revise your lesson, give it a higher version number each time
  text: "<p> Many students find it easier to learn music theory when they practice a lot. In other words,\
         physically creating sounds by playing a musical instrument (such as the piano) helps you to better \
         visualize and listen to the music you are writing down or studying. This allows students to \
         understand the relationship between different steps more quickly.\
         When you sit at the piano, it is important to sit up straight, keeping your head over your shoulders, \
         which should be kept down. Your elbows should be a comfortable distance from your body, and your fingers \
         should remain arched (as if you were pulling a library book off of a shelf). Keep your knees and wrists \
         flexible (not stiff), and keep your feet flat on the ground unless you are using the pedals. \
         Learning to play notes on the piano is one easy way to be with music in touch. You may find access \
         to a piano keyboard (acoustic or electronic) at your school. Another option is to download a free piano app \
         that you can play on your phone, such as Tiny Piano. Notice that the keyboard has both white keys and black \
         keys. The black keys are grouped into sets of either three or two.</p>",
  text_source: "unknown - TODO",
  text_licence: "unknown - TODO",
  text_url: "unknown - TODO",
    tasks: [  // the list of tasks for this lesson
      {
      name:  "Playing the piano",
      type: "R",          // Reading task - options: R = reading, GS = grammar/style, V = vocabulary
      interaction: "MC",  // Single choice task - options: SC = single choice, MC = multiple choice, GAPSEL = select options for gaps, GAPFILL = fill in the gaps
      primary: true,      // the primary task will be shown first, non-primary tasks are for repitition
      show_lesson_text: true,  // Shall we show the lesson reading text? true/false
      question:  "Which of the following answers are correct?",  // the question to be displayed
      choices: [  // a list of options displayed to be selected (single choice: only one, multiple choice: more than one possible)
        {
          text:  "To learn music theory, many students prefer to read a lot.",
          correct: false,
          feedback:  "False! Students find it easier, if they practice a lot"
        },
        {
          text:  "To better visualize the music it is important to practice a lot",
          correct: true,
          feedback:  "True!"
        },
        {
          text:  "You need to sit up straight at the piano",
          correct: true,
          feedback:  "True!",
        },
        {
          text:  "You can download a piano app for some money",
          correct: false,
          feedback:  "Wrong! Most App are free and used to learn the notes for the piano",
        },
        {
          text:  "The keyboard has both red keys and green keys",
          correct: false,
          feedback:  "Wrong! Obviously the keyboard has black and white keys",
        },
      ]  // end of list of choices
    },  // end of task 1

      {  // task 2: mark the words
        name: "Definitions",
        type: "V",
        interaction: "MARK",
        primary: true,
        show_lesson_text: false,
        question: "In the text, find the words according to the following definitions:",
        marktext: "Many students find it easier to learn music theory when they practice a lot. In other words,\
        physically creating #2#sounds by playing a musical instrument (such as the #1#piano) helps you to better \
        #5#visualize and listen to the music you are writing down or studying. This allows students to \
        understand the relationship between different steps more quickly.\
        When you sit at the piano, it is important to sit up straight, keeping your head over your shoulders, \
        which should be kept down. Your elbows should be a comfortable distance from your body, and your fingers \
        should remain arched (as if you were pulling a library book off of a shelf). Keep your knees and wrists \
        flexible (not stiff), and keep your feet flat on the ground unless you are using the #3#pedals. \
        Learning to play notes on the piano is one easy way to be with music in touch. You may find access \
        to a piano keyboard (acoustic or electronic) at your school. Another option is to download a free piano app \
        that you can play on your phone, such as Tiny Piano. Notice that the #4#keyboard has both white keys and black \
        keys. The black keys are grouped into sets of either three or two.", // could be a problem since there are piano multiple times
        markers: {
          '1': {
            description: 'a large musical instrument with a row of black and white keys that are pressed to play notes', // could be a problem since there are piano 
          },
          '2': {
            description: 'something that you can hear or that can be heard',
          },
          '3': {
            description: 'a part on a piano or organ that you press with your foot', 
          },
          '4': {
            description: 'the set of keys on a piano' //multiple times keyboard
          },
          '5': {
            description: 'to imagine or remember someone or something by forming a picture in your mind '
          }
        } // end of markers list
      } // end of task 2

    ] // end of tasks

} // end of lesson
